[{
  slug: 'Euro 2016 - Cesc Fabregas: I spoke to Sergio Ramos after Spain swipe',
  headline: 'Chelsea midfielder Cesc Fabregas has set the record straight with Spain team-mate Sergio Ramos, who questioned his commitment to the national team.',
  photo: 'img/fabregas.jpg',
  content: 'Fabregas and club team-mate Diego Costa missed Spain\'s last two encounters - a 3-0 triumph over Belarus in a Euro 2016 qualifier and a 1-0 defeat to Germany in a friendly - earlier this month with injuries. Real Madrid defender Ramos questioned the absence of the two Chelsea players, who had played for 90 minutes in the 2-1 Premier League win at Liverpool just days prior to joining Spain\'s training camp. "Yes I felt like he was alluding to me," Fabregas told Spanish radio station Cadena Cope. "I hate that someone doubts my commitment. "I have played many games (for Spain) and have joined the national team many times without playing. "I\'ve played a total of 94 games for Spain, I\'ve been going for nine years, always. And with a big smile. "I already told Sergio what I thought about it (his comments). "I told him that we played together since the U21s and there was no need for him to send messages through the press. "I said to him that he could call me up and tell it to my face. View photo .Cesc Fabregas of Spain runs with the ball during an international friendly match between El Salvador and Spain at FedExField on June 7 Cesc Fabregas of Spain runs with the ball during an international friendly match between El Salvador and Spain … "Everything is clear now and that\'s what we had to do, to speak. "We spoke on the phone and everything is fine." The 27-year-old insists it was crucial for him to remain in London during the international break in order to recover from a hamstring problem. "I had a tendinitis in my left leg and had I played, I could have suffered the same situation as (Luka) Modric," Fabregas said. Real Madrid\'s Croatian midfielder Modric aggravated a thigh injury in a 1-1 draw against Italy and will be sidelined for three months. "I told the (Spain) coach (Vicente del Bosque) and everything was fine," Fabregas said. "He had the same thing when he was a player." Despite his recurring hamstring problems, Fabregas has enjoyed a superb start to life at Chelsea since moving to the London outfit this summer after three seasons at Barcelona. Fabregas has scored one goal and set up 10 more in 12 Premier League appearances so far to help Jose Mourinho\'s side lead the Premier League. "I am playing football with him (Mourinho) where I feel really good, in the position I like to play in," he said. "I feel free. "Perhaps I\'m playing the best football of my career. "I hold the ball and the confidence just keeps growing."'
},
{
  slug: 'Formula 1 - Mercedes to open Lewis Hamilton contract talks',
  headline: 'The Mercedes Formula 1 team is ready to sit down and thrash out a new contract with Lewis Hamilton, but warns the deal may take some time to sort out.',
  photo: 'img/hamilton.jpg',
  content: 'Amid the heat of the title battle between Hamilton and team-mate Nico Rosberg, Mercedes agreed to hold fire on contract talks until the championship was over. With Hamilton now having triumphed thanks to his victory in the Abu Dhabi Grand Prix, discussions are expected to start in the next few weeks to start working towards a contract extension beyond 2015. Mercedes boss Toto Wolff says, however, that there is unlikely to be an instant agreement - although that does not mean there is any intention on Mercedes\' part to pursue any other drivers. "It is never easy because it is a decision with consequences for the driver, for Lewis and for us," he said. "Stability is a very crucial ingredient for us and the team, which is why we are sitting down to discuss the future. "It is clear that Lewis feels at home at the team. The car is the most competitive now and so we\'ve ticked two boxes, but equally it is never easy to find all the terms to make it happen. View photo .Lewis Hamilton Lewis Hamilton "We would love Lewis to stay in the team. He has been an incredible part in the development of the rise of the team and we would like him to stay - and I think he wants it too. "But it\'s not just a case of a couple of hours and ticking the box. It requires a reflection and discussion." Niki Lauda, Mercedes\' non-executive chairman, was adamant that the contract with Hamilton should be sorted before Christmas. When asked if he could foresee any problems in the two parties coming towards an agreement, Lauda said: "No, not at all. "We are going to do this in the next two weeks. He\'s happy, we\'re happy. I don\'t see any issues."'
}]
